case-clean/0/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// you can test this dictionary with
// foamDictionary ./0.orig/U

dimensions      [0 1 -1 0 0 0 0];

#include "../system/globalDefs"

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        //type  fixedValue;
        type    flowRateInletVelocity; // should not be used with potential foam
        // https://cpp.openfoam.org/v11/classFoam_1_1flowRateInletVelocityFvPatchVectorField.html
        // v2312 https://api.openfoam.com/2312/classFoam_1_1flowRateInletVelocityFvPatchVectorField.html#details
        //volumetricFlowRate  0.032; // square D = 0.1 m, V = 3.2 m/s, Q = D^2 * V
        //volumetricFlowRate  0.02513; // circular D = 0.1 m, V = 3.2 m/s, Q = pi/4 * D^2 * V
        volumetricFlowRate  $myFlowRate; // calculated in globalDefs
        profile             laminarBL; // v11
        //extrapolateProfile  yes; // v1812, v2312, not available in v11, no effect in v11
        //value    uniform (0 0 0);
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        //value           $internalField;
    }

    wall
    {
        type            noSlip;
    }
}


// ************************************************************************* //
